["java.util.HashMap",{"Pot of Greed":"Draw 2 cards.","Umiiruka":"Increase the ATK of all WATER monsters by 500 points and decrease their DEF by 400 points.","Magic Jamamer":"When a Spell Card is activated: Discard 1 card; negate the activation, and if you do, destroy it.","Solemn Warning":"When a monster(s) would be Summoned, OR when a Spell/Trap Card, or monster effect, is activated that includes an effect that Special Summons a monster(s): Pay 2000 LP; negate the Summon or activation, and if you do, destroy it.","Raigeki":"Destroy all monsters your opponent controls.","Twin Twisters":"Discard 1 card, then target up to 2 Spells/Traps on the field; destroy them.","Terraforming":"Add 1 Field Spell from your Deck to your hand.","Spell Absorption":"Each time a Spell Card is activated, gain 500 Life Points immediately after it resolves.","Monster Reborn":"Target 1 monster in either GY; Special Summon it.","Negate Attack":"When an opponent's monster declares an attack: Target the attacking monster; negate the attack, then end the Battle Phase.","Mystical space typhoon":"Target 1 Spell/Trap on the field; destroy that target.","Vanity's Emptiness":"Neither player can Special Summon monsters. If a card is sent from the Deck or the field to your Graveyard: Destroy this card.","Call of The Haunted":"Activate this card by targeting 1 monster in your GY; Special Summon that target in Attack Position. When this card leaves the field, destroy that monster. When that monster is destroyed, destroy this card.","Trap Hole":"When your opponent Normal or Flip Summons 1 monster with 1000 or more ATK: Target that monster; destroy that target.","Time Seal":"Skip the Draw Phase of your opponent's next turn.","Supply Squad":"Once per turn, if a monster(s) you control is destroyed by battle or card effect: Draw 1 card.","Dark Hole":"Destroy all monsters on the field.","Yami":"All Fiend and Spellcaster monsters on the field gain 200 ATK/DEF, also all Fairy monsters on the field lose 200 ATK/DEF.","Advanced Ritual Art":"This card can be used to Ritual Summon any 1 Ritual Monster. You must also send Normal Monsters from your Deck to the Graveyard whose total Levels equal the Level of that Ritual Monster.","Magic Cylinder":"When an opponent's monster declares an attack: Target the attacking monster; negate the attack, and if you do, inflict damage to your opponent equal to its ATK.","Mind Crush":"Declare 1 card name; if that card is in your opponent's hand, they must discard all copies of it, otherwise you discard 1 random card.","Harpie's Feather Duster":"Destroy all Spells and Traps your opponent controls.","Ring of defense":"When a Trap effect that inflicts damage is activated: Make that effect damage 0.","Closed Forest":"All Beast-Type monsters you control gain 100 ATK for each monster in your Graveyard. Field Spell Cards cannot be activated. Field Spell Cards cannot be activated during the turn this card is destroyed.","Mirror Force":"When an opponent's monster declares an attack: Destroy all your opponent's Attack Position monsters.","Torrential Tribute":"When a monster(s) is Summoned: Destroy all monsters on the field.","Forest":"All Insect, Beast, Plant, and Beast-Warrior monsters on the field gain 200 ATK/DEF.","Wall of Revealing Light":"Activate by paying any multiple of 1000 Life Points. Monsters your opponent controls cannot attack if their ATK is less than or equal to the amount you paid."}]